In [1]:
import pandas as pd

In [2]:
# 2 main datatypes
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
# series - 1-dimensional

In [5]:
colours = pd.Series(["Red", "Blue", "White"])
colours

0      Red
1     Blue
2    White
dtype: object

In [6]:
# DataFrame = 2-dimensional
car_data = pd.DataFrame ({ "Car make": series, "Colour": colours})
car_data

  Car make Colour
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [7]:
# Import data
car_sales = pd.read_csv("car-sales .csv")

In [8]:
car_sales

  Make;Colour;Odometer;Doors;Price
0       Toyota;White;150043;4;4000
1           Honda;Red;87899;4;5000
2         Toyota;Blue;92549;3;7000
3          BMW;Black;11179;5;22000
4       Nissan;White;213095;4;3500
5        Toyota;Green;99213;4;4500
6          Honda;Blue;45698;4;7500
7          Honda;Blue;54738;4;7000
8        Toyota;White;60000;4;6250
9        Nissan;White;31600;4;9700

In [9]:
# Exporting a DataFrame
car_sales.to_csv("exported-car-sales.csv", index=False)

In [10]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

  Make;Colour;Odometer;Doors;Price
0       Toyota;White;150043;4;4000
1           Honda;Red;87899;4;5000
2         Toyota;Blue;92549;3;7000
3          BMW;Black;11179;5;22000
4       Nissan;White;213095;4;3500
5        Toyota;Green;99213;4;4500
6          Honda;Blue;45698;4;7500
7          Honda;Blue;54738;4;7000
8        Toyota;White;60000;4;6250
9        Nissan;White;31600;4;9700

In [11]:
# Attribute
car_sales.dtypes

# Function 
#car_sales.to_csv()

Make;Colour;Odometer;Doors;Price    object
dtype: object

In [12]:
car_sales.columns

Index(['Make;Colour;Odometer;Doors;Price'], dtype='object')

In [13]:
car_columns = car_sales.columns
car_columns

Index(['Make;Colour;Odometer;Doors;Price'], dtype='object')

In [14]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
car_sales

  Make;Colour;Odometer;Doors;Price
0       Toyota;White;150043;4;4000
1           Honda;Red;87899;4;5000
2         Toyota;Blue;92549;3;7000
3          BMW;Black;11179;5;22000
4       Nissan;White;213095;4;3500
5        Toyota;Green;99213;4;4500
6          Honda;Blue;45698;4;7500
7          Honda;Blue;54738;4;7000
8        Toyota;White;60000;4;6250
9        Nissan;White;31600;4;9700

In [16]:
car_sales.describe()

       Make;Colour;Odometer;Doors;Price
count                                10
unique                               10
top          Toyota;White;150043;4;4000
freq                                  1

In [17]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 1 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Make;Colour;Odometer;Doors;Price  10 non-null     object
dtypes: object(1)
memory usage: 208.0+ bytes

In [18]:
car_prices = pd.Series([3000, 1500, 111250])
car_prices.mean()

38583.333333333336

In [19]:
car_sales.sum()

Make;Colour;Odometer;Doors;Price    Toyota;White;150043;4;4000Honda;Red;87899;4;50...
dtype: object

In [32]:
car_sales

  Make;Colour;Odometer;Doors;Price
0       Toyota;White;150043;4;4000
1           Honda;Red;87899;4;5000
2         Toyota;Blue;92549;3;7000
3          BMW;Black;11179;5;22000
4       Nissan;White;213095;4;3500
5        Toyota;Green;99213;4;4500
6          Honda;Blue;45698;4;7500
7          Honda;Blue;54738;4;7000
8        Toyota;White;60000;4;6250
9        Nissan;White;31600;4;9700

In [33]:
len(car_sales)

10

## Viewing and selecting data

In [34]:
car_sales.head(4)

  Make;Colour;Odometer;Doors;Price
0       Toyota;White;150043;4;4000
1           Honda;Red;87899;4;5000
2         Toyota;Blue;92549;3;7000
3          BMW;Black;11179;5;22000

In [35]:
car_sales.tail()

  Make;Colour;Odometer;Doors;Price
5        Toyota;Green;99213;4;4500
6          Honda;Blue;45698;4;7500
7          Honda;Blue;54738;4;7000
8        Toyota;White;60000;4;6250
9        Nissan;White;31600;4;9700

In [36]:
# .loc & .iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"],
                    index=[0, 3, 9, 8, 3])

In [37]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [38]:
animals.loc[3]

3      dog
3    snake
dtype: object

In [39]:
car_sales

  Make;Colour;Odometer;Doors;Price
0       Toyota;White;150043;4;4000
1           Honda;Red;87899;4;5000
2         Toyota;Blue;92549;3;7000
3          BMW;Black;11179;5;22000
4       Nissan;White;213095;4;3500
5        Toyota;Green;99213;4;4500
6          Honda;Blue;45698;4;7500
7          Honda;Blue;54738;4;7000
8        Toyota;White;60000;4;6250
9        Nissan;White;31600;4;9700

In [40]:
car_sales.loc[3]

Make;Colour;Odometer;Doors;Price    BMW;Black;11179;5;22000
Name: 3, dtype: object

In [41]:
# .loc refers to index
# .iloc refers to position
animals.iloc[3]

'panda'

In [42]:
car_sales.iloc[3]

Make;Colour;Odometer;Doors;Price    BMW;Black;11179;5;22000
Name: 3, dtype: object

In [43]:
car_sales.loc[:3]

  Make;Colour;Odometer;Doors;Price
0       Toyota;White;150043;4;4000
1           Honda;Red;87899;4;5000
2         Toyota;Blue;92549;3;7000
3          BMW;Black;11179;5;22000

In [44]:
car_sales.head(4)

  Make;Colour;Odometer;Doors;Price
0       Toyota;White;150043;4;4000
1           Honda;Red;87899;4;5000
2         Toyota;Blue;92549;3;7000
3          BMW;Black;11179;5;22000

In [45]:
%matplotlib inline
import matplotlib.pyplot as plt